//**. Напишите программу, которая на вход принимает значение, а
// на выходе показывает обратное значение.

double num = Double.Parse(Console.ReadLine());

Console.WriteLine(1 / num);
